import { Component, OnInit } from '@angular/core';
import { MainApiService, NewsCategory } from '@dpt/shared';
import { Router } from '@angular/router';

@Component({
  selector: 'dpt-news',
  templateUrl: './news.component.html',
  styleUrls: ['./news.component.scss'],
})
export class NewsComponent implements OnInit {
  selectedIndex = 0;
  newsList: NewsCategory[] = [
    {
      link: 'https://www.dpt.go.th/th/press-release',
      title: 'ข่าวกิจกรรม',
      description: '',
      category: 'CMS',
      lastBuildDate: 'Sat, 08 Apr 2023 16:43:00 +0700',
      language: 'th-th',
      item: [
        {
          title:
            'การประชุมหารือกลุ่มย่อย (Focus Group) ครั้งที่ ๑ การวางผังนโยบายระดับประเทศ เรื่อง ”(ร่าง) นโยบายโครงสร้างพื้นฐาน : ด้านพลังงาน”',
          description:
            'การประชุมหารือกลุ่มย่อย (Focus Group) ครั้งที่ ๑ การวางผังนโยบายระดับประเทศ เรื่อง ”(ร่าง) นโยบายโครงสร้างพื้นฐาน : ด้านพลังงาน”',
          link: 'https://www.dpt.go.th/th/press-release/8186',
          category: 'ข่าวงานผังประเทศและผังภาค',
          pubDate: 'Thu, 30 Mar 2023 13:26:01 +0700',
        },
        {
          title:
            'ประกาศกรมธนารักษ์ เรื่อง การสรรหาผู้ลงทุนพัฒนาที่ดินราชพัสดุในพื้นที่เขตพัฒนาเศรษฐกิจพิเศษมุกดาหาร ท้องที่ ต.คำอาฮวน อ.เมืองมุกดาหาร จ.มุกดาหาร',
          description:
            'ประกาศกรมธนารักษ์ เรื่อง การสรรหาผู้ลงทุนพัฒนาที่ดินราชพัสดุในพื้นที่เขตพัฒนาเศรษฐกิจพิเศษมุกดาหาร ท้องที่ ต.คำอาฮวน อ.เมืองมุกดาหาร จ.มุกดาหาร เนื้อที่สองแปลงรวมประมาณ ๑,๐๘๑ ไร่ ๐ งาน ๒๓.๑๐ วา โดยให้สิทธิแก่ผู้ลงทุนเช่าที่ดินราชพัสดุเป็นเวลา ๕๐ ปี นับแต่วันลงนามในสัญญาเช่าที่ดินราชพัสดุเป็นต้นไป ด้้วยวิธีเสนอผลประโยชน์ตอบแทนการเช่าและข้อเสนอด้านการลงทุนพัฒนาในพื้นที่เขตพัฒนาเศรษฐกิจพิเศษที่ก่อให้เกิดคุณค่าสูงสุดต่อประเทศตามเงื่อนไข รายละเอียดตามเอกสารแนบ',
          link: 'https://www.dpt.go.th/th/press-release/8172',
          category: 'ประชาสัมพันธ์ทั่วไป',
          pubDate: 'Fri, 10 Mar 2023 12:44:14 +0700',
        },
        {
          title:
            'ขอเชิญประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๑ ผังเมืองรวมชุมชนควนเนียง จังหวัดสงขลา',
          description:
            'ขอเชิญประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๑ ผังเมืองรวมชุมชนควนเนียง จังหวัดสงขลา',
          link: 'https://www.dpt.go.th/th/press-release/8168',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Wed, 08 Mar 2023 09:21:21 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมการประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๒ ผังเมืองรวมเมืองระยอง จังหวัดระยอง',
          description:
            'ขอเชิญเข้าร่วมการประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๒ ผังเมืองรวมเมืองระยอง จังหวัดระยอง',
          link: 'https://www.dpt.go.th/th/press-release/8167',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Tue, 07 Mar 2023 13:48:31 +0700',
        },
        {
          title:
            'การประชุมหารือกลุ่มย่อย ( Focus Group ) ครั้งที่ 1 การวางผังนโยบายระดับประเทศ วันพฤหัสบดีที่ 28 กุมภาพันธ์ 2566',
          description:
            'การประชุมหารือกลุ่มย่อย ( Focus Group ) ครั้งที่ 1 การวางผังนโยบายระดับประเทศ วันพฤหัสบดีที่ 28 กุมภาพันธ์ 2566',
          link: 'https://www.dpt.go.th/th/press-release/8166',
          category: 'ข่าวงานผังประเทศและผังภาค',
          pubDate: 'Tue, 07 Mar 2023 13:46:15 +0700',
        },
        {
          title:
            'ผู้ปฎิบัติตามมาตรฐานคุณธรรมจริยธรรมของกรมโยธาธิการและผังเมือง ประจำปีงบประมาณ พ.ศ.๒๕๖๖',
          description:
            'ผู้ปฎิบัติตามมาตรฐานคุณธรรมจริยธรรมของกรมโยธาธิการและผังเมือง ประจำปีงบประมาณ พ.ศ.๒๕๖๖',
          link: 'https://www.dpt.go.th/th/press-release/8165',
          category: 'ประชาสัมพันธ์ทั่วไป',
          pubDate: 'Fri, 03 Mar 2023 15:19:45 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมสนทนากลุ่มย่อย ครั้งที่ ๑ (เพื่อจัดทำผังแนวคิด) ผังเมืองรวมชุมชนพระพรหม จังหวัดนครศรีธรรมราช',
          description:
            'ขอเชิญเข้าร่วมประชุมสนทนากลุ่มย่อย ครั้งที่ ๑ (เพื่อจัดทำผังแนวคิด) ผังเมืองรวมชุมชนพระพรหม จังหวัดนครศรีธรรมราช',
          link: 'https://www.dpt.go.th/th/press-release/8164',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Fri, 03 Mar 2023 11:08:20 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมสนทนากลุ่มย่อยครั้งที่ ๓ เพื่อพิจารณาร่างผังเมืองรวมชุมชนปะทิว จังหวัดชุมพร',
          description:
            'ขอเชิญเข้าร่วมประชุมสนทนากลุ่มย่อยครั้งที่ ๓ เพื่อพิจารณาร่างผังเมืองรวมชุมชนปะทิว จังหวัดชุมพร',
          link: 'https://www.dpt.go.th/th/press-release/8163',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Fri, 03 Mar 2023 08:52:46 +0700',
        },
        {
          title:
            'อธิบดีโยธาฯ ลงพื้นที่สั่งเข้มเพิ่มมาตรการให้ผู้รับจ้างเร่งทำงาน โครงการแก้ไขปัญหาน้ำท่วมกาฬสินธุ์ ให้แล้วเสร็จโดยเร็ว',
          description:
            'อธิบดีโยธาฯ ลงพื้นที่สั่งเข้มเพิ่มมาตรการให้ผู้รับจ้างเร่งทำงาน โครงการแก้ไขปัญหาน้ำท่วมกาฬสินธุ์ ให้แล้วเสร็จโดยเร็วเหตุจากผู้รับจ้างทำงานล่าช้า ทำชาวบ้านเดือดร้อน',
          link: 'https://www.dpt.go.th/th/press-release/8153',
          category: 'ชี้แจงประเด็นข่าว',
          pubDate: 'Sat, 25 Feb 2023 14:47:55 +0700',
        },
        {
          title:
            'การประชุมหารือกลุ่มย่อย (Focus Group) ครั้งที่ 1 การวางผังนโยบายระดับประเทศ',
          description:
            'เรื่อง (ร่าง) ผังนโยบายโครงสร้างพื้นฐาน : ระบบเทคโนโลยีสารสนเทศ (ICT)',
          link: 'https://www.dpt.go.th/th/press-release/8152',
          category: 'ข่าวงานผังประเทศและผังภาค',
          pubDate: 'Fri, 24 Feb 2023 16:18:09 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๑ ผังเมืองรวมชุมชนหนองปรือ จังหวัดกาญจนบุรี',
          description:
            'ขอเชิญเข้าร่วมประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๑ ผังเมืองรวมชุมชนหนองปรือ จังหวัดกาญจนบุรี',
          link: 'https://www.dpt.go.th/th/press-release/8151',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Tue, 21 Feb 2023 10:40:54 +0700',
        },
        {
          title:
            'ขอเชิญประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๓ ผังเมืองรวมเมืองตราด (ปรับปรุงครั้งที่ ๓)',
          description:
            'ขอเชิญประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๓ ผังเมืองรวมเมืองตราด (ปรับปรุงครั้งที่ ๓)',
          link: 'https://www.dpt.go.th/th/press-release/8150',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Tue, 21 Feb 2023 09:03:48 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมแสดงความคิดเห็นเกี่ยวกับการวางและจัดทำผังเมืองรวมชุมชนศรีมโหสถ จังหวัดปราจีนบุรี',
          description:
            'ขอเชิญเข้าร่วมประชุมแสดงความคิดเห็นเกี่ยวกับการวางและจัดทำผังเมืองรวมชุมชนศรีมโหสถ จังหวัดปราจีนบุรี',
          link: 'https://www.dpt.go.th/th/press-release/8149',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Tue, 21 Feb 2023 09:00:21 +0700',
        },
        {
          title:
            'การประชุมหารือกลุ่มย่อย ( Focus Group ) ครั้งที่ 1 การวางผังนโยบายระดับประเทศ',
          description:
            'การประชุมหารือกลุ่มย่อย ( Focus Group ) ครั้งที่ 1 การวางผังนโยบายระดับประเทศ',
          link: 'https://www.dpt.go.th/th/press-release/8140',
          category: 'ข่าวงานผังประเทศและผังภาค',
          pubDate: 'Thu, 16 Feb 2023 13:34:56 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๑ ผังเมืองรวมชุมชนทุ่งตะโก จังหวัดชุมพร',
          description:
            'ขอเชิญเข้าร่วมประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๑ ผังเมืองรวมชุมชนทุ่งตะโก จังหวัดชุมพร',
          link: 'https://www.dpt.go.th/th/press-release/8136',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Tue, 14 Feb 2023 11:13:27 +0700',
        },
        {
          title:
            'กรมโยธาฯ แจง ประเด็น ”วุ่นอีก !! ชาวอำเภอบ้านแพงลุกฮือโวย กรมโยธาฯ นั่งเทียนออกผังเมืองลิดรอนสิทธิ์”',
          description:
            'กรมโยธาฯ แจง ประเด็น ”วุ่นอีก !! ชาวอำเภอบ้านแพงลุกฮือโวย กรมโยธาฯ นั่งเทียนออกผังเมืองลิดรอนสิทธิ์” ยันทุกอย่างจะต้องดำเนินการภายใต้ความต้องการของพี่น้องประชาชน',
          link: 'https://www.dpt.go.th/th/press-release/8133',
          category: 'ชี้แจงประเด็นข่าว',
          pubDate: 'Mon, 13 Feb 2023 14:23:16 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมเพื่อรับฟังความคิดเห็นของประชาชน ก่อนจัดทำผังแนวคิด (ประชุมกลุ่มย่อยครั้งที่ ๑) ผังเมืองรวมชุมชนควนกาหลง จังหวัดสตูล',
          description:
            'ขอเชิญเข้าร่วมประชุมเพื่อรับฟังความคิดเห็นของประชาชน ก่อนจัดทำผังแนวคิด (ประชุมกลุ่มย่อยครั้งที่ ๑) ผังเมืองรวมชุมชนควนกาหลง จังหวัดสตูล',
          link: 'https://www.dpt.go.th/th/press-release/8128',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Tue, 07 Feb 2023 15:50:12 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๒ ผังเมืองรวมเมืองชลบุรี',
          description:
            'ขอเชิญเข้าร่วมประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๒ ผังเมืองรวมเมืองชลบุรี',
          link: 'https://www.dpt.go.th/th/press-release/8127',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Mon, 06 Feb 2023 15:41:51 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมการประชุมเชิงปฏิบัติการ (ประชุมกลุ่มย่อย เพื่อจัดทำผังแนวคิด) ครั้งที่ ๑/๒๕๖๖ ผังเมืองรวมชุมชนบ้านด่าน จังหวัดบุรีรัมย์',
          description:
            'ขอเชิญเข้าร่วมการประชุมเชิงปฏิบัติการ (ประชุมกลุ่มย่อย เพื่อจัดทำผังแนวคิด) ครั้งที่ ๑/๒๕๖๖ ผังเมืองรวมชุมชนบ้านด่าน จังหวัดบุรีรัมย์',
          link: 'https://www.dpt.go.th/th/press-release/8126',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Thu, 02 Feb 2023 11:11:55 +0700',
        },
        {
          title:
            'กรมโยธาฯ แจง กรณี “โครงการพัฒนาคลองลำท่าแดงล่าช้า” สั่งเร่งรัดการก่อสร้างและแก้ไขจุดชำรุด บรรเทาความเดือดร้อนพี่น้องประชาชน',
          description:
            'กรมโยธาฯ แจง กรณี “โครงการพัฒนาคลองลำท่าแดงล่าช้า” สั่งเร่งรัดการก่อสร้างและแก้ไขจุดชำรุด บรรเทาความเดือดร้อนพี่น้องประชาชน',
          link: 'https://www.dpt.go.th/th/press-release/8121',
          category: 'ชี้แจงประเด็นข่าว',
          pubDate: 'Fri, 27 Jan 2023 21:10:46 +0700',
        },
      ],
    },
    {
      link: 'https://www.dpt.go.th/th/press-release',
      title: 'ข่าวประชาสัมพันธ์ทั่วไป',
      description: '',
      category: 'DMS',
      lastBuildDate: 'Sat, 08 Apr 2023 16:43:00 +0700',
      language: 'th-th',
      item: [
        {
          title:
            'การประชุมหารือกลุ่มย่อย (Focus Group) ครั้งที่ ๑ การวางผังนโยบายระดับประเทศ เรื่อง ”(ร่าง) นโยบายโครงสร้างพื้นฐาน : ด้านพลังงาน”',
          description:
            'การประชุมหารือกลุ่มย่อย (Focus Group) ครั้งที่ ๑ การวางผังนโยบายระดับประเทศ เรื่อง ”(ร่าง) นโยบายโครงสร้างพื้นฐาน : ด้านพลังงาน”',
          link: 'https://www.dpt.go.th/th/press-release/8186',
          category: 'ข่าวงานผังประเทศและผังภาค',
          pubDate: 'Thu, 30 Mar 2023 13:26:01 +0700',
        },
        {
          title:
            'ประกาศกรมธนารักษ์ เรื่อง การสรรหาผู้ลงทุนพัฒนาที่ดินราชพัสดุในพื้นที่เขตพัฒนาเศรษฐกิจพิเศษมุกดาหาร ท้องที่ ต.คำอาฮวน อ.เมืองมุกดาหาร จ.มุกดาหาร',
          description:
            'ประกาศกรมธนารักษ์ เรื่อง การสรรหาผู้ลงทุนพัฒนาที่ดินราชพัสดุในพื้นที่เขตพัฒนาเศรษฐกิจพิเศษมุกดาหาร ท้องที่ ต.คำอาฮวน อ.เมืองมุกดาหาร จ.มุกดาหาร เนื้อที่สองแปลงรวมประมาณ ๑,๐๘๑ ไร่ ๐ งาน ๒๓.๑๐ วา โดยให้สิทธิแก่ผู้ลงทุนเช่าที่ดินราชพัสดุเป็นเวลา ๕๐ ปี นับแต่วันลงนามในสัญญาเช่าที่ดินราชพัสดุเป็นต้นไป ด้้วยวิธีเสนอผลประโยชน์ตอบแทนการเช่าและข้อเสนอด้านการลงทุนพัฒนาในพื้นที่เขตพัฒนาเศรษฐกิจพิเศษที่ก่อให้เกิดคุณค่าสูงสุดต่อประเทศตามเงื่อนไข รายละเอียดตามเอกสารแนบ',
          link: 'https://www.dpt.go.th/th/press-release/8172',
          category: 'ประชาสัมพันธ์ทั่วไป',
          pubDate: 'Fri, 10 Mar 2023 12:44:14 +0700',
        },
        {
          title:
            'ขอเชิญประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๑ ผังเมืองรวมชุมชนควนเนียง จังหวัดสงขลา',
          description:
            'ขอเชิญประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๑ ผังเมืองรวมชุมชนควนเนียง จังหวัดสงขลา',
          link: 'https://www.dpt.go.th/th/press-release/8168',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Wed, 08 Mar 2023 09:21:21 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมการประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๒ ผังเมืองรวมเมืองระยอง จังหวัดระยอง',
          description:
            'ขอเชิญเข้าร่วมการประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๒ ผังเมืองรวมเมืองระยอง จังหวัดระยอง',
          link: 'https://www.dpt.go.th/th/press-release/8167',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Tue, 07 Mar 2023 13:48:31 +0700',
        },
        {
          title:
            'การประชุมหารือกลุ่มย่อย ( Focus Group ) ครั้งที่ 1 การวางผังนโยบายระดับประเทศ วันพฤหัสบดีที่ 28 กุมภาพันธ์ 2566',
          description:
            'การประชุมหารือกลุ่มย่อย ( Focus Group ) ครั้งที่ 1 การวางผังนโยบายระดับประเทศ วันพฤหัสบดีที่ 28 กุมภาพันธ์ 2566',
          link: 'https://www.dpt.go.th/th/press-release/8166',
          category: 'ข่าวงานผังประเทศและผังภาค',
          pubDate: 'Tue, 07 Mar 2023 13:46:15 +0700',
        },
        {
          title:
            'ผู้ปฎิบัติตามมาตรฐานคุณธรรมจริยธรรมของกรมโยธาธิการและผังเมือง ประจำปีงบประมาณ พ.ศ.๒๕๖๖',
          description:
            'ผู้ปฎิบัติตามมาตรฐานคุณธรรมจริยธรรมของกรมโยธาธิการและผังเมือง ประจำปีงบประมาณ พ.ศ.๒๕๖๖',
          link: 'https://www.dpt.go.th/th/press-release/8165',
          category: 'ประชาสัมพันธ์ทั่วไป',
          pubDate: 'Fri, 03 Mar 2023 15:19:45 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมสนทนากลุ่มย่อย ครั้งที่ ๑ (เพื่อจัดทำผังแนวคิด) ผังเมืองรวมชุมชนพระพรหม จังหวัดนครศรีธรรมราช',
          description:
            'ขอเชิญเข้าร่วมประชุมสนทนากลุ่มย่อย ครั้งที่ ๑ (เพื่อจัดทำผังแนวคิด) ผังเมืองรวมชุมชนพระพรหม จังหวัดนครศรีธรรมราช',
          link: 'https://www.dpt.go.th/th/press-release/8164',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Fri, 03 Mar 2023 11:08:20 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมสนทนากลุ่มย่อยครั้งที่ ๓ เพื่อพิจารณาร่างผังเมืองรวมชุมชนปะทิว จังหวัดชุมพร',
          description:
            'ขอเชิญเข้าร่วมประชุมสนทนากลุ่มย่อยครั้งที่ ๓ เพื่อพิจารณาร่างผังเมืองรวมชุมชนปะทิว จังหวัดชุมพร',
          link: 'https://www.dpt.go.th/th/press-release/8163',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Fri, 03 Mar 2023 08:52:46 +0700',
        },
        {
          title:
            'อธิบดีโยธาฯ ลงพื้นที่สั่งเข้มเพิ่มมาตรการให้ผู้รับจ้างเร่งทำงาน โครงการแก้ไขปัญหาน้ำท่วมกาฬสินธุ์ ให้แล้วเสร็จโดยเร็ว',
          description:
            'อธิบดีโยธาฯ ลงพื้นที่สั่งเข้มเพิ่มมาตรการให้ผู้รับจ้างเร่งทำงาน โครงการแก้ไขปัญหาน้ำท่วมกาฬสินธุ์ ให้แล้วเสร็จโดยเร็วเหตุจากผู้รับจ้างทำงานล่าช้า ทำชาวบ้านเดือดร้อน',
          link: 'https://www.dpt.go.th/th/press-release/8153',
          category: 'ชี้แจงประเด็นข่าว',
          pubDate: 'Sat, 25 Feb 2023 14:47:55 +0700',
        },
        {
          title:
            'การประชุมหารือกลุ่มย่อย (Focus Group) ครั้งที่ 1 การวางผังนโยบายระดับประเทศ',
          description:
            'เรื่อง (ร่าง) ผังนโยบายโครงสร้างพื้นฐาน : ระบบเทคโนโลยีสารสนเทศ (ICT)',
          link: 'https://www.dpt.go.th/th/press-release/8152',
          category: 'ข่าวงานผังประเทศและผังภาค',
          pubDate: 'Fri, 24 Feb 2023 16:18:09 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๑ ผังเมืองรวมชุมชนหนองปรือ จังหวัดกาญจนบุรี',
          description:
            'ขอเชิญเข้าร่วมประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๑ ผังเมืองรวมชุมชนหนองปรือ จังหวัดกาญจนบุรี',
          link: 'https://www.dpt.go.th/th/press-release/8151',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Tue, 21 Feb 2023 10:40:54 +0700',
        },
        {
          title:
            'ขอเชิญประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๓ ผังเมืองรวมเมืองตราด (ปรับปรุงครั้งที่ ๓)',
          description:
            'ขอเชิญประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๓ ผังเมืองรวมเมืองตราด (ปรับปรุงครั้งที่ ๓)',
          link: 'https://www.dpt.go.th/th/press-release/8150',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Tue, 21 Feb 2023 09:03:48 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมแสดงความคิดเห็นเกี่ยวกับการวางและจัดทำผังเมืองรวมชุมชนศรีมโหสถ จังหวัดปราจีนบุรี',
          description:
            'ขอเชิญเข้าร่วมประชุมแสดงความคิดเห็นเกี่ยวกับการวางและจัดทำผังเมืองรวมชุมชนศรีมโหสถ จังหวัดปราจีนบุรี',
          link: 'https://www.dpt.go.th/th/press-release/8149',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Tue, 21 Feb 2023 09:00:21 +0700',
        },
        {
          title:
            'การประชุมหารือกลุ่มย่อย ( Focus Group ) ครั้งที่ 1 การวางผังนโยบายระดับประเทศ',
          description:
            'การประชุมหารือกลุ่มย่อย ( Focus Group ) ครั้งที่ 1 การวางผังนโยบายระดับประเทศ',
          link: 'https://www.dpt.go.th/th/press-release/8140',
          category: 'ข่าวงานผังประเทศและผังภาค',
          pubDate: 'Thu, 16 Feb 2023 13:34:56 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๑ ผังเมืองรวมชุมชนทุ่งตะโก จังหวัดชุมพร',
          description:
            'ขอเชิญเข้าร่วมประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๑ ผังเมืองรวมชุมชนทุ่งตะโก จังหวัดชุมพร',
          link: 'https://www.dpt.go.th/th/press-release/8136',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Tue, 14 Feb 2023 11:13:27 +0700',
        },
        {
          title:
            'กรมโยธาฯ แจง ประเด็น ”วุ่นอีก !! ชาวอำเภอบ้านแพงลุกฮือโวย กรมโยธาฯ นั่งเทียนออกผังเมืองลิดรอนสิทธิ์”',
          description:
            'กรมโยธาฯ แจง ประเด็น ”วุ่นอีก !! ชาวอำเภอบ้านแพงลุกฮือโวย กรมโยธาฯ นั่งเทียนออกผังเมืองลิดรอนสิทธิ์” ยันทุกอย่างจะต้องดำเนินการภายใต้ความต้องการของพี่น้องประชาชน',
          link: 'https://www.dpt.go.th/th/press-release/8133',
          category: 'ชี้แจงประเด็นข่าว',
          pubDate: 'Mon, 13 Feb 2023 14:23:16 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมเพื่อรับฟังความคิดเห็นของประชาชน ก่อนจัดทำผังแนวคิด (ประชุมกลุ่มย่อยครั้งที่ ๑) ผังเมืองรวมชุมชนควนกาหลง จังหวัดสตูล',
          description:
            'ขอเชิญเข้าร่วมประชุมเพื่อรับฟังความคิดเห็นของประชาชน ก่อนจัดทำผังแนวคิด (ประชุมกลุ่มย่อยครั้งที่ ๑) ผังเมืองรวมชุมชนควนกาหลง จังหวัดสตูล',
          link: 'https://www.dpt.go.th/th/press-release/8128',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Tue, 07 Feb 2023 15:50:12 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๒ ผังเมืองรวมเมืองชลบุรี',
          description:
            'ขอเชิญเข้าร่วมประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๒ ผังเมืองรวมเมืองชลบุรี',
          link: 'https://www.dpt.go.th/th/press-release/8127',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Mon, 06 Feb 2023 15:41:51 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมการประชุมเชิงปฏิบัติการ (ประชุมกลุ่มย่อย เพื่อจัดทำผังแนวคิด) ครั้งที่ ๑/๒๕๖๖ ผังเมืองรวมชุมชนบ้านด่าน จังหวัดบุรีรัมย์',
          description:
            'ขอเชิญเข้าร่วมการประชุมเชิงปฏิบัติการ (ประชุมกลุ่มย่อย เพื่อจัดทำผังแนวคิด) ครั้งที่ ๑/๒๕๖๖ ผังเมืองรวมชุมชนบ้านด่าน จังหวัดบุรีรัมย์',
          link: 'https://www.dpt.go.th/th/press-release/8126',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Thu, 02 Feb 2023 11:11:55 +0700',
        },
        {
          title:
            'กรมโยธาฯ แจง กรณี “โครงการพัฒนาคลองลำท่าแดงล่าช้า” สั่งเร่งรัดการก่อสร้างและแก้ไขจุดชำรุด บรรเทาความเดือดร้อนพี่น้องประชาชน',
          description:
            'กรมโยธาฯ แจง กรณี “โครงการพัฒนาคลองลำท่าแดงล่าช้า” สั่งเร่งรัดการก่อสร้างและแก้ไขจุดชำรุด บรรเทาความเดือดร้อนพี่น้องประชาชน',
          link: 'https://www.dpt.go.th/th/press-release/8121',
          category: 'ชี้แจงประเด็นข่าว',
          pubDate: 'Fri, 27 Jan 2023 21:10:46 +0700',
        },
      ],
    },
    {
      link: 'https://www.dpt.go.th/th/press-release',
      title: 'ข่าวตัดจากหนังสิอพิมพ์',
      description: '',
      category: 'EMS',
      lastBuildDate: 'Sat, 08 Apr 2023 16:43:00 +0700',
      language: 'th-th',
      item: [
        {
          title:
            'การประชุมหารือกลุ่มย่อย (Focus Group) ครั้งที่ ๑ การวางผังนโยบายระดับประเทศ เรื่อง ”(ร่าง) นโยบายโครงสร้างพื้นฐาน : ด้านพลังงาน”',
          description:
            'การประชุมหารือกลุ่มย่อย (Focus Group) ครั้งที่ ๑ การวางผังนโยบายระดับประเทศ เรื่อง ”(ร่าง) นโยบายโครงสร้างพื้นฐาน : ด้านพลังงาน”',
          link: 'https://www.dpt.go.th/th/press-release/8186',
          category: 'ข่าวงานผังประเทศและผังภาค',
          pubDate: 'Thu, 30 Mar 2023 13:26:01 +0700',
        },
        {
          title:
            'ประกาศกรมธนารักษ์ เรื่อง การสรรหาผู้ลงทุนพัฒนาที่ดินราชพัสดุในพื้นที่เขตพัฒนาเศรษฐกิจพิเศษมุกดาหาร ท้องที่ ต.คำอาฮวน อ.เมืองมุกดาหาร จ.มุกดาหาร',
          description:
            'ประกาศกรมธนารักษ์ เรื่อง การสรรหาผู้ลงทุนพัฒนาที่ดินราชพัสดุในพื้นที่เขตพัฒนาเศรษฐกิจพิเศษมุกดาหาร ท้องที่ ต.คำอาฮวน อ.เมืองมุกดาหาร จ.มุกดาหาร เนื้อที่สองแปลงรวมประมาณ ๑,๐๘๑ ไร่ ๐ งาน ๒๓.๑๐ วา โดยให้สิทธิแก่ผู้ลงทุนเช่าที่ดินราชพัสดุเป็นเวลา ๕๐ ปี นับแต่วันลงนามในสัญญาเช่าที่ดินราชพัสดุเป็นต้นไป ด้้วยวิธีเสนอผลประโยชน์ตอบแทนการเช่าและข้อเสนอด้านการลงทุนพัฒนาในพื้นที่เขตพัฒนาเศรษฐกิจพิเศษที่ก่อให้เกิดคุณค่าสูงสุดต่อประเทศตามเงื่อนไข รายละเอียดตามเอกสารแนบ',
          link: 'https://www.dpt.go.th/th/press-release/8172',
          category: 'ประชาสัมพันธ์ทั่วไป',
          pubDate: 'Fri, 10 Mar 2023 12:44:14 +0700',
        },
        {
          title:
            'ขอเชิญประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๑ ผังเมืองรวมชุมชนควนเนียง จังหวัดสงขลา',
          description:
            'ขอเชิญประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๑ ผังเมืองรวมชุมชนควนเนียง จังหวัดสงขลา',
          link: 'https://www.dpt.go.th/th/press-release/8168',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Wed, 08 Mar 2023 09:21:21 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมการประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๒ ผังเมืองรวมเมืองระยอง จังหวัดระยอง',
          description:
            'ขอเชิญเข้าร่วมการประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๒ ผังเมืองรวมเมืองระยอง จังหวัดระยอง',
          link: 'https://www.dpt.go.th/th/press-release/8167',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Tue, 07 Mar 2023 13:48:31 +0700',
        },
        {
          title:
            'การประชุมหารือกลุ่มย่อย ( Focus Group ) ครั้งที่ 1 การวางผังนโยบายระดับประเทศ วันพฤหัสบดีที่ 28 กุมภาพันธ์ 2566',
          description:
            'การประชุมหารือกลุ่มย่อย ( Focus Group ) ครั้งที่ 1 การวางผังนโยบายระดับประเทศ วันพฤหัสบดีที่ 28 กุมภาพันธ์ 2566',
          link: 'https://www.dpt.go.th/th/press-release/8166',
          category: 'ข่าวงานผังประเทศและผังภาค',
          pubDate: 'Tue, 07 Mar 2023 13:46:15 +0700',
        },
        {
          title:
            'ผู้ปฎิบัติตามมาตรฐานคุณธรรมจริยธรรมของกรมโยธาธิการและผังเมือง ประจำปีงบประมาณ พ.ศ.๒๕๖๖',
          description:
            'ผู้ปฎิบัติตามมาตรฐานคุณธรรมจริยธรรมของกรมโยธาธิการและผังเมือง ประจำปีงบประมาณ พ.ศ.๒๕๖๖',
          link: 'https://www.dpt.go.th/th/press-release/8165',
          category: 'ประชาสัมพันธ์ทั่วไป',
          pubDate: 'Fri, 03 Mar 2023 15:19:45 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมสนทนากลุ่มย่อย ครั้งที่ ๑ (เพื่อจัดทำผังแนวคิด) ผังเมืองรวมชุมชนพระพรหม จังหวัดนครศรีธรรมราช',
          description:
            'ขอเชิญเข้าร่วมประชุมสนทนากลุ่มย่อย ครั้งที่ ๑ (เพื่อจัดทำผังแนวคิด) ผังเมืองรวมชุมชนพระพรหม จังหวัดนครศรีธรรมราช',
          link: 'https://www.dpt.go.th/th/press-release/8164',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Fri, 03 Mar 2023 11:08:20 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมสนทนากลุ่มย่อยครั้งที่ ๓ เพื่อพิจารณาร่างผังเมืองรวมชุมชนปะทิว จังหวัดชุมพร',
          description:
            'ขอเชิญเข้าร่วมประชุมสนทนากลุ่มย่อยครั้งที่ ๓ เพื่อพิจารณาร่างผังเมืองรวมชุมชนปะทิว จังหวัดชุมพร',
          link: 'https://www.dpt.go.th/th/press-release/8163',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Fri, 03 Mar 2023 08:52:46 +0700',
        },
        {
          title:
            'อธิบดีโยธาฯ ลงพื้นที่สั่งเข้มเพิ่มมาตรการให้ผู้รับจ้างเร่งทำงาน โครงการแก้ไขปัญหาน้ำท่วมกาฬสินธุ์ ให้แล้วเสร็จโดยเร็ว',
          description:
            'อธิบดีโยธาฯ ลงพื้นที่สั่งเข้มเพิ่มมาตรการให้ผู้รับจ้างเร่งทำงาน โครงการแก้ไขปัญหาน้ำท่วมกาฬสินธุ์ ให้แล้วเสร็จโดยเร็วเหตุจากผู้รับจ้างทำงานล่าช้า ทำชาวบ้านเดือดร้อน',
          link: 'https://www.dpt.go.th/th/press-release/8153',
          category: 'ชี้แจงประเด็นข่าว',
          pubDate: 'Sat, 25 Feb 2023 14:47:55 +0700',
        },
        {
          title:
            'การประชุมหารือกลุ่มย่อย (Focus Group) ครั้งที่ 1 การวางผังนโยบายระดับประเทศ',
          description:
            'เรื่อง (ร่าง) ผังนโยบายโครงสร้างพื้นฐาน : ระบบเทคโนโลยีสารสนเทศ (ICT)',
          link: 'https://www.dpt.go.th/th/press-release/8152',
          category: 'ข่าวงานผังประเทศและผังภาค',
          pubDate: 'Fri, 24 Feb 2023 16:18:09 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๑ ผังเมืองรวมชุมชนหนองปรือ จังหวัดกาญจนบุรี',
          description:
            'ขอเชิญเข้าร่วมประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๑ ผังเมืองรวมชุมชนหนองปรือ จังหวัดกาญจนบุรี',
          link: 'https://www.dpt.go.th/th/press-release/8151',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Tue, 21 Feb 2023 10:40:54 +0700',
        },
        {
          title:
            'ขอเชิญประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๓ ผังเมืองรวมเมืองตราด (ปรับปรุงครั้งที่ ๓)',
          description:
            'ขอเชิญประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๓ ผังเมืองรวมเมืองตราด (ปรับปรุงครั้งที่ ๓)',
          link: 'https://www.dpt.go.th/th/press-release/8150',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Tue, 21 Feb 2023 09:03:48 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมแสดงความคิดเห็นเกี่ยวกับการวางและจัดทำผังเมืองรวมชุมชนศรีมโหสถ จังหวัดปราจีนบุรี',
          description:
            'ขอเชิญเข้าร่วมประชุมแสดงความคิดเห็นเกี่ยวกับการวางและจัดทำผังเมืองรวมชุมชนศรีมโหสถ จังหวัดปราจีนบุรี',
          link: 'https://www.dpt.go.th/th/press-release/8149',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Tue, 21 Feb 2023 09:00:21 +0700',
        },
        {
          title:
            'การประชุมหารือกลุ่มย่อย ( Focus Group ) ครั้งที่ 1 การวางผังนโยบายระดับประเทศ',
          description:
            'การประชุมหารือกลุ่มย่อย ( Focus Group ) ครั้งที่ 1 การวางผังนโยบายระดับประเทศ',
          link: 'https://www.dpt.go.th/th/press-release/8140',
          category: 'ข่าวงานผังประเทศและผังภาค',
          pubDate: 'Thu, 16 Feb 2023 13:34:56 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๑ ผังเมืองรวมชุมชนทุ่งตะโก จังหวัดชุมพร',
          description:
            'ขอเชิญเข้าร่วมประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๑ ผังเมืองรวมชุมชนทุ่งตะโก จังหวัดชุมพร',
          link: 'https://www.dpt.go.th/th/press-release/8136',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Tue, 14 Feb 2023 11:13:27 +0700',
        },
        {
          title:
            'กรมโยธาฯ แจง ประเด็น ”วุ่นอีก !! ชาวอำเภอบ้านแพงลุกฮือโวย กรมโยธาฯ นั่งเทียนออกผังเมืองลิดรอนสิทธิ์”',
          description:
            'กรมโยธาฯ แจง ประเด็น ”วุ่นอีก !! ชาวอำเภอบ้านแพงลุกฮือโวย กรมโยธาฯ นั่งเทียนออกผังเมืองลิดรอนสิทธิ์” ยันทุกอย่างจะต้องดำเนินการภายใต้ความต้องการของพี่น้องประชาชน',
          link: 'https://www.dpt.go.th/th/press-release/8133',
          category: 'ชี้แจงประเด็นข่าว',
          pubDate: 'Mon, 13 Feb 2023 14:23:16 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมเพื่อรับฟังความคิดเห็นของประชาชน ก่อนจัดทำผังแนวคิด (ประชุมกลุ่มย่อยครั้งที่ ๑) ผังเมืองรวมชุมชนควนกาหลง จังหวัดสตูล',
          description:
            'ขอเชิญเข้าร่วมประชุมเพื่อรับฟังความคิดเห็นของประชาชน ก่อนจัดทำผังแนวคิด (ประชุมกลุ่มย่อยครั้งที่ ๑) ผังเมืองรวมชุมชนควนกาหลง จังหวัดสตูล',
          link: 'https://www.dpt.go.th/th/press-release/8128',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Tue, 07 Feb 2023 15:50:12 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๒ ผังเมืองรวมเมืองชลบุรี',
          description:
            'ขอเชิญเข้าร่วมประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๒ ผังเมืองรวมเมืองชลบุรี',
          link: 'https://www.dpt.go.th/th/press-release/8127',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Mon, 06 Feb 2023 15:41:51 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมการประชุมเชิงปฏิบัติการ (ประชุมกลุ่มย่อย เพื่อจัดทำผังแนวคิด) ครั้งที่ ๑/๒๕๖๖ ผังเมืองรวมชุมชนบ้านด่าน จังหวัดบุรีรัมย์',
          description:
            'ขอเชิญเข้าร่วมการประชุมเชิงปฏิบัติการ (ประชุมกลุ่มย่อย เพื่อจัดทำผังแนวคิด) ครั้งที่ ๑/๒๕๖๖ ผังเมืองรวมชุมชนบ้านด่าน จังหวัดบุรีรัมย์',
          link: 'https://www.dpt.go.th/th/press-release/8126',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Thu, 02 Feb 2023 11:11:55 +0700',
        },
        {
          title:
            'กรมโยธาฯ แจง กรณี “โครงการพัฒนาคลองลำท่าแดงล่าช้า” สั่งเร่งรัดการก่อสร้างและแก้ไขจุดชำรุด บรรเทาความเดือดร้อนพี่น้องประชาชน',
          description:
            'กรมโยธาฯ แจง กรณี “โครงการพัฒนาคลองลำท่าแดงล่าช้า” สั่งเร่งรัดการก่อสร้างและแก้ไขจุดชำรุด บรรเทาความเดือดร้อนพี่น้องประชาชน',
          link: 'https://www.dpt.go.th/th/press-release/8121',
          category: 'ชี้แจงประเด็นข่าว',
          pubDate: 'Fri, 27 Jan 2023 21:10:46 +0700',
        },
      ],
    },
    {
      link: 'https://www.dpt.go.th/th/press-release',
      title: 'ข่าว/ประกาศกรม',
      description: '',
      category: 'FMS',
      lastBuildDate: 'Sat, 08 Apr 2023 16:43:00 +0700',
      language: 'th-th',
      item: [
        {
          title:
            'การประชุมหารือกลุ่มย่อย (Focus Group) ครั้งที่ ๑ การวางผังนโยบายระดับประเทศ เรื่อง ”(ร่าง) นโยบายโครงสร้างพื้นฐาน : ด้านพลังงาน”',
          description:
            'การประชุมหารือกลุ่มย่อย (Focus Group) ครั้งที่ ๑ การวางผังนโยบายระดับประเทศ เรื่อง ”(ร่าง) นโยบายโครงสร้างพื้นฐาน : ด้านพลังงาน”',
          link: 'https://www.dpt.go.th/th/press-release/8186',
          category: 'ข่าวงานผังประเทศและผังภาค',
          pubDate: 'Thu, 30 Mar 2023 13:26:01 +0700',
        },
        {
          title:
            'ประกาศกรมธนารักษ์ เรื่อง การสรรหาผู้ลงทุนพัฒนาที่ดินราชพัสดุในพื้นที่เขตพัฒนาเศรษฐกิจพิเศษมุกดาหาร ท้องที่ ต.คำอาฮวน อ.เมืองมุกดาหาร จ.มุกดาหาร',
          description:
            'ประกาศกรมธนารักษ์ เรื่อง การสรรหาผู้ลงทุนพัฒนาที่ดินราชพัสดุในพื้นที่เขตพัฒนาเศรษฐกิจพิเศษมุกดาหาร ท้องที่ ต.คำอาฮวน อ.เมืองมุกดาหาร จ.มุกดาหาร เนื้อที่สองแปลงรวมประมาณ ๑,๐๘๑ ไร่ ๐ งาน ๒๓.๑๐ วา โดยให้สิทธิแก่ผู้ลงทุนเช่าที่ดินราชพัสดุเป็นเวลา ๕๐ ปี นับแต่วันลงนามในสัญญาเช่าที่ดินราชพัสดุเป็นต้นไป ด้้วยวิธีเสนอผลประโยชน์ตอบแทนการเช่าและข้อเสนอด้านการลงทุนพัฒนาในพื้นที่เขตพัฒนาเศรษฐกิจพิเศษที่ก่อให้เกิดคุณค่าสูงสุดต่อประเทศตามเงื่อนไข รายละเอียดตามเอกสารแนบ',
          link: 'https://www.dpt.go.th/th/press-release/8172',
          category: 'ประชาสัมพันธ์ทั่วไป',
          pubDate: 'Fri, 10 Mar 2023 12:44:14 +0700',
        },
        {
          title:
            'ขอเชิญประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๑ ผังเมืองรวมชุมชนควนเนียง จังหวัดสงขลา',
          description:
            'ขอเชิญประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๑ ผังเมืองรวมชุมชนควนเนียง จังหวัดสงขลา',
          link: 'https://www.dpt.go.th/th/press-release/8168',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Wed, 08 Mar 2023 09:21:21 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมการประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๒ ผังเมืองรวมเมืองระยอง จังหวัดระยอง',
          description:
            'ขอเชิญเข้าร่วมการประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๒ ผังเมืองรวมเมืองระยอง จังหวัดระยอง',
          link: 'https://www.dpt.go.th/th/press-release/8167',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Tue, 07 Mar 2023 13:48:31 +0700',
        },
        {
          title:
            'การประชุมหารือกลุ่มย่อย ( Focus Group ) ครั้งที่ 1 การวางผังนโยบายระดับประเทศ วันพฤหัสบดีที่ 28 กุมภาพันธ์ 2566',
          description:
            'การประชุมหารือกลุ่มย่อย ( Focus Group ) ครั้งที่ 1 การวางผังนโยบายระดับประเทศ วันพฤหัสบดีที่ 28 กุมภาพันธ์ 2566',
          link: 'https://www.dpt.go.th/th/press-release/8166',
          category: 'ข่าวงานผังประเทศและผังภาค',
          pubDate: 'Tue, 07 Mar 2023 13:46:15 +0700',
        },
        {
          title:
            'ผู้ปฎิบัติตามมาตรฐานคุณธรรมจริยธรรมของกรมโยธาธิการและผังเมือง ประจำปีงบประมาณ พ.ศ.๒๕๖๖',
          description:
            'ผู้ปฎิบัติตามมาตรฐานคุณธรรมจริยธรรมของกรมโยธาธิการและผังเมือง ประจำปีงบประมาณ พ.ศ.๒๕๖๖',
          link: 'https://www.dpt.go.th/th/press-release/8165',
          category: 'ประชาสัมพันธ์ทั่วไป',
          pubDate: 'Fri, 03 Mar 2023 15:19:45 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมสนทนากลุ่มย่อย ครั้งที่ ๑ (เพื่อจัดทำผังแนวคิด) ผังเมืองรวมชุมชนพระพรหม จังหวัดนครศรีธรรมราช',
          description:
            'ขอเชิญเข้าร่วมประชุมสนทนากลุ่มย่อย ครั้งที่ ๑ (เพื่อจัดทำผังแนวคิด) ผังเมืองรวมชุมชนพระพรหม จังหวัดนครศรีธรรมราช',
          link: 'https://www.dpt.go.th/th/press-release/8164',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Fri, 03 Mar 2023 11:08:20 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมสนทนากลุ่มย่อยครั้งที่ ๓ เพื่อพิจารณาร่างผังเมืองรวมชุมชนปะทิว จังหวัดชุมพร',
          description:
            'ขอเชิญเข้าร่วมประชุมสนทนากลุ่มย่อยครั้งที่ ๓ เพื่อพิจารณาร่างผังเมืองรวมชุมชนปะทิว จังหวัดชุมพร',
          link: 'https://www.dpt.go.th/th/press-release/8163',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Fri, 03 Mar 2023 08:52:46 +0700',
        },
        {
          title:
            'อธิบดีโยธาฯ ลงพื้นที่สั่งเข้มเพิ่มมาตรการให้ผู้รับจ้างเร่งทำงาน โครงการแก้ไขปัญหาน้ำท่วมกาฬสินธุ์ ให้แล้วเสร็จโดยเร็ว',
          description:
            'อธิบดีโยธาฯ ลงพื้นที่สั่งเข้มเพิ่มมาตรการให้ผู้รับจ้างเร่งทำงาน โครงการแก้ไขปัญหาน้ำท่วมกาฬสินธุ์ ให้แล้วเสร็จโดยเร็วเหตุจากผู้รับจ้างทำงานล่าช้า ทำชาวบ้านเดือดร้อน',
          link: 'https://www.dpt.go.th/th/press-release/8153',
          category: 'ชี้แจงประเด็นข่าว',
          pubDate: 'Sat, 25 Feb 2023 14:47:55 +0700',
        },
        {
          title:
            'การประชุมหารือกลุ่มย่อย (Focus Group) ครั้งที่ 1 การวางผังนโยบายระดับประเทศ',
          description:
            'เรื่อง (ร่าง) ผังนโยบายโครงสร้างพื้นฐาน : ระบบเทคโนโลยีสารสนเทศ (ICT)',
          link: 'https://www.dpt.go.th/th/press-release/8152',
          category: 'ข่าวงานผังประเทศและผังภาค',
          pubDate: 'Fri, 24 Feb 2023 16:18:09 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๑ ผังเมืองรวมชุมชนหนองปรือ จังหวัดกาญจนบุรี',
          description:
            'ขอเชิญเข้าร่วมประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๑ ผังเมืองรวมชุมชนหนองปรือ จังหวัดกาญจนบุรี',
          link: 'https://www.dpt.go.th/th/press-release/8151',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Tue, 21 Feb 2023 10:40:54 +0700',
        },
        {
          title:
            'ขอเชิญประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๓ ผังเมืองรวมเมืองตราด (ปรับปรุงครั้งที่ ๓)',
          description:
            'ขอเชิญประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๓ ผังเมืองรวมเมืองตราด (ปรับปรุงครั้งที่ ๓)',
          link: 'https://www.dpt.go.th/th/press-release/8150',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Tue, 21 Feb 2023 09:03:48 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมแสดงความคิดเห็นเกี่ยวกับการวางและจัดทำผังเมืองรวมชุมชนศรีมโหสถ จังหวัดปราจีนบุรี',
          description:
            'ขอเชิญเข้าร่วมประชุมแสดงความคิดเห็นเกี่ยวกับการวางและจัดทำผังเมืองรวมชุมชนศรีมโหสถ จังหวัดปราจีนบุรี',
          link: 'https://www.dpt.go.th/th/press-release/8149',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Tue, 21 Feb 2023 09:00:21 +0700',
        },
        {
          title:
            'การประชุมหารือกลุ่มย่อย ( Focus Group ) ครั้งที่ 1 การวางผังนโยบายระดับประเทศ',
          description:
            'การประชุมหารือกลุ่มย่อย ( Focus Group ) ครั้งที่ 1 การวางผังนโยบายระดับประเทศ',
          link: 'https://www.dpt.go.th/th/press-release/8140',
          category: 'ข่าวงานผังประเทศและผังภาค',
          pubDate: 'Thu, 16 Feb 2023 13:34:56 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๑ ผังเมืองรวมชุมชนทุ่งตะโก จังหวัดชุมพร',
          description:
            'ขอเชิญเข้าร่วมประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๑ ผังเมืองรวมชุมชนทุ่งตะโก จังหวัดชุมพร',
          link: 'https://www.dpt.go.th/th/press-release/8136',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Tue, 14 Feb 2023 11:13:27 +0700',
        },
        {
          title:
            'กรมโยธาฯ แจง ประเด็น ”วุ่นอีก !! ชาวอำเภอบ้านแพงลุกฮือโวย กรมโยธาฯ นั่งเทียนออกผังเมืองลิดรอนสิทธิ์”',
          description:
            'กรมโยธาฯ แจง ประเด็น ”วุ่นอีก !! ชาวอำเภอบ้านแพงลุกฮือโวย กรมโยธาฯ นั่งเทียนออกผังเมืองลิดรอนสิทธิ์” ยันทุกอย่างจะต้องดำเนินการภายใต้ความต้องการของพี่น้องประชาชน',
          link: 'https://www.dpt.go.th/th/press-release/8133',
          category: 'ชี้แจงประเด็นข่าว',
          pubDate: 'Mon, 13 Feb 2023 14:23:16 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมเพื่อรับฟังความคิดเห็นของประชาชน ก่อนจัดทำผังแนวคิด (ประชุมกลุ่มย่อยครั้งที่ ๑) ผังเมืองรวมชุมชนควนกาหลง จังหวัดสตูล',
          description:
            'ขอเชิญเข้าร่วมประชุมเพื่อรับฟังความคิดเห็นของประชาชน ก่อนจัดทำผังแนวคิด (ประชุมกลุ่มย่อยครั้งที่ ๑) ผังเมืองรวมชุมชนควนกาหลง จังหวัดสตูล',
          link: 'https://www.dpt.go.th/th/press-release/8128',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Tue, 07 Feb 2023 15:50:12 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๒ ผังเมืองรวมเมืองชลบุรี',
          description:
            'ขอเชิญเข้าร่วมประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๒ ผังเมืองรวมเมืองชลบุรี',
          link: 'https://www.dpt.go.th/th/press-release/8127',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Mon, 06 Feb 2023 15:41:51 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมการประชุมเชิงปฏิบัติการ (ประชุมกลุ่มย่อย เพื่อจัดทำผังแนวคิด) ครั้งที่ ๑/๒๕๖๖ ผังเมืองรวมชุมชนบ้านด่าน จังหวัดบุรีรัมย์',
          description:
            'ขอเชิญเข้าร่วมการประชุมเชิงปฏิบัติการ (ประชุมกลุ่มย่อย เพื่อจัดทำผังแนวคิด) ครั้งที่ ๑/๒๕๖๖ ผังเมืองรวมชุมชนบ้านด่าน จังหวัดบุรีรัมย์',
          link: 'https://www.dpt.go.th/th/press-release/8126',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Thu, 02 Feb 2023 11:11:55 +0700',
        },
        {
          title:
            'กรมโยธาฯ แจง กรณี “โครงการพัฒนาคลองลำท่าแดงล่าช้า” สั่งเร่งรัดการก่อสร้างและแก้ไขจุดชำรุด บรรเทาความเดือดร้อนพี่น้องประชาชน',
          description:
            'กรมโยธาฯ แจง กรณี “โครงการพัฒนาคลองลำท่าแดงล่าช้า” สั่งเร่งรัดการก่อสร้างและแก้ไขจุดชำรุด บรรเทาความเดือดร้อนพี่น้องประชาชน',
          link: 'https://www.dpt.go.th/th/press-release/8121',
          category: 'ชี้แจงประเด็นข่าว',
          pubDate: 'Fri, 27 Jan 2023 21:10:46 +0700',
        },
      ],
    },
    {
      link: 'https://www.dpt.go.th/th/press-release',
      title: 'วารสารกรม',
      description: '',
      category: 'GMS',
      lastBuildDate: 'Sat, 08 Apr 2023 16:43:00 +0700',
      language: 'th-th',
      item: [
        {
          title:
            'การประชุมหารือกลุ่มย่อย (Focus Group) ครั้งที่ ๑ การวางผังนโยบายระดับประเทศ เรื่อง ”(ร่าง) นโยบายโครงสร้างพื้นฐาน : ด้านพลังงาน”',
          description:
            'การประชุมหารือกลุ่มย่อย (Focus Group) ครั้งที่ ๑ การวางผังนโยบายระดับประเทศ เรื่อง ”(ร่าง) นโยบายโครงสร้างพื้นฐาน : ด้านพลังงาน”',
          link: 'https://www.dpt.go.th/th/press-release/8186',
          category: 'ข่าวงานผังประเทศและผังภาค',
          pubDate: 'Thu, 30 Mar 2023 13:26:01 +0700',
        },
        {
          title:
            'ประกาศกรมธนารักษ์ เรื่อง การสรรหาผู้ลงทุนพัฒนาที่ดินราชพัสดุในพื้นที่เขตพัฒนาเศรษฐกิจพิเศษมุกดาหาร ท้องที่ ต.คำอาฮวน อ.เมืองมุกดาหาร จ.มุกดาหาร',
          description:
            'ประกาศกรมธนารักษ์ เรื่อง การสรรหาผู้ลงทุนพัฒนาที่ดินราชพัสดุในพื้นที่เขตพัฒนาเศรษฐกิจพิเศษมุกดาหาร ท้องที่ ต.คำอาฮวน อ.เมืองมุกดาหาร จ.มุกดาหาร เนื้อที่สองแปลงรวมประมาณ ๑,๐๘๑ ไร่ ๐ งาน ๒๓.๑๐ วา โดยให้สิทธิแก่ผู้ลงทุนเช่าที่ดินราชพัสดุเป็นเวลา ๕๐ ปี นับแต่วันลงนามในสัญญาเช่าที่ดินราชพัสดุเป็นต้นไป ด้้วยวิธีเสนอผลประโยชน์ตอบแทนการเช่าและข้อเสนอด้านการลงทุนพัฒนาในพื้นที่เขตพัฒนาเศรษฐกิจพิเศษที่ก่อให้เกิดคุณค่าสูงสุดต่อประเทศตามเงื่อนไข รายละเอียดตามเอกสารแนบ',
          link: 'https://www.dpt.go.th/th/press-release/8172',
          category: 'ประชาสัมพันธ์ทั่วไป',
          pubDate: 'Fri, 10 Mar 2023 12:44:14 +0700',
        },
        {
          title:
            'ขอเชิญประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๑ ผังเมืองรวมชุมชนควนเนียง จังหวัดสงขลา',
          description:
            'ขอเชิญประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๑ ผังเมืองรวมชุมชนควนเนียง จังหวัดสงขลา',
          link: 'https://www.dpt.go.th/th/press-release/8168',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Wed, 08 Mar 2023 09:21:21 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมการประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๒ ผังเมืองรวมเมืองระยอง จังหวัดระยอง',
          description:
            'ขอเชิญเข้าร่วมการประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๒ ผังเมืองรวมเมืองระยอง จังหวัดระยอง',
          link: 'https://www.dpt.go.th/th/press-release/8167',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Tue, 07 Mar 2023 13:48:31 +0700',
        },
        {
          title:
            'การประชุมหารือกลุ่มย่อย ( Focus Group ) ครั้งที่ 1 การวางผังนโยบายระดับประเทศ วันพฤหัสบดีที่ 28 กุมภาพันธ์ 2566',
          description:
            'การประชุมหารือกลุ่มย่อย ( Focus Group ) ครั้งที่ 1 การวางผังนโยบายระดับประเทศ วันพฤหัสบดีที่ 28 กุมภาพันธ์ 2566',
          link: 'https://www.dpt.go.th/th/press-release/8166',
          category: 'ข่าวงานผังประเทศและผังภาค',
          pubDate: 'Tue, 07 Mar 2023 13:46:15 +0700',
        },
        {
          title:
            'ผู้ปฎิบัติตามมาตรฐานคุณธรรมจริยธรรมของกรมโยธาธิการและผังเมือง ประจำปีงบประมาณ พ.ศ.๒๕๖๖',
          description:
            'ผู้ปฎิบัติตามมาตรฐานคุณธรรมจริยธรรมของกรมโยธาธิการและผังเมือง ประจำปีงบประมาณ พ.ศ.๒๕๖๖',
          link: 'https://www.dpt.go.th/th/press-release/8165',
          category: 'ประชาสัมพันธ์ทั่วไป',
          pubDate: 'Fri, 03 Mar 2023 15:19:45 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมสนทนากลุ่มย่อย ครั้งที่ ๑ (เพื่อจัดทำผังแนวคิด) ผังเมืองรวมชุมชนพระพรหม จังหวัดนครศรีธรรมราช',
          description:
            'ขอเชิญเข้าร่วมประชุมสนทนากลุ่มย่อย ครั้งที่ ๑ (เพื่อจัดทำผังแนวคิด) ผังเมืองรวมชุมชนพระพรหม จังหวัดนครศรีธรรมราช',
          link: 'https://www.dpt.go.th/th/press-release/8164',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Fri, 03 Mar 2023 11:08:20 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมสนทนากลุ่มย่อยครั้งที่ ๓ เพื่อพิจารณาร่างผังเมืองรวมชุมชนปะทิว จังหวัดชุมพร',
          description:
            'ขอเชิญเข้าร่วมประชุมสนทนากลุ่มย่อยครั้งที่ ๓ เพื่อพิจารณาร่างผังเมืองรวมชุมชนปะทิว จังหวัดชุมพร',
          link: 'https://www.dpt.go.th/th/press-release/8163',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Fri, 03 Mar 2023 08:52:46 +0700',
        },
        {
          title:
            'อธิบดีโยธาฯ ลงพื้นที่สั่งเข้มเพิ่มมาตรการให้ผู้รับจ้างเร่งทำงาน โครงการแก้ไขปัญหาน้ำท่วมกาฬสินธุ์ ให้แล้วเสร็จโดยเร็ว',
          description:
            'อธิบดีโยธาฯ ลงพื้นที่สั่งเข้มเพิ่มมาตรการให้ผู้รับจ้างเร่งทำงาน โครงการแก้ไขปัญหาน้ำท่วมกาฬสินธุ์ ให้แล้วเสร็จโดยเร็วเหตุจากผู้รับจ้างทำงานล่าช้า ทำชาวบ้านเดือดร้อน',
          link: 'https://www.dpt.go.th/th/press-release/8153',
          category: 'ชี้แจงประเด็นข่าว',
          pubDate: 'Sat, 25 Feb 2023 14:47:55 +0700',
        },
        {
          title:
            'การประชุมหารือกลุ่มย่อย (Focus Group) ครั้งที่ 1 การวางผังนโยบายระดับประเทศ',
          description:
            'เรื่อง (ร่าง) ผังนโยบายโครงสร้างพื้นฐาน : ระบบเทคโนโลยีสารสนเทศ (ICT)',
          link: 'https://www.dpt.go.th/th/press-release/8152',
          category: 'ข่าวงานผังประเทศและผังภาค',
          pubDate: 'Fri, 24 Feb 2023 16:18:09 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๑ ผังเมืองรวมชุมชนหนองปรือ จังหวัดกาญจนบุรี',
          description:
            'ขอเชิญเข้าร่วมประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๑ ผังเมืองรวมชุมชนหนองปรือ จังหวัดกาญจนบุรี',
          link: 'https://www.dpt.go.th/th/press-release/8151',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Tue, 21 Feb 2023 10:40:54 +0700',
        },
        {
          title:
            'ขอเชิญประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๓ ผังเมืองรวมเมืองตราด (ปรับปรุงครั้งที่ ๓)',
          description:
            'ขอเชิญประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๓ ผังเมืองรวมเมืองตราด (ปรับปรุงครั้งที่ ๓)',
          link: 'https://www.dpt.go.th/th/press-release/8150',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Tue, 21 Feb 2023 09:03:48 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมแสดงความคิดเห็นเกี่ยวกับการวางและจัดทำผังเมืองรวมชุมชนศรีมโหสถ จังหวัดปราจีนบุรี',
          description:
            'ขอเชิญเข้าร่วมประชุมแสดงความคิดเห็นเกี่ยวกับการวางและจัดทำผังเมืองรวมชุมชนศรีมโหสถ จังหวัดปราจีนบุรี',
          link: 'https://www.dpt.go.th/th/press-release/8149',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Tue, 21 Feb 2023 09:00:21 +0700',
        },
        {
          title:
            'การประชุมหารือกลุ่มย่อย ( Focus Group ) ครั้งที่ 1 การวางผังนโยบายระดับประเทศ',
          description:
            'การประชุมหารือกลุ่มย่อย ( Focus Group ) ครั้งที่ 1 การวางผังนโยบายระดับประเทศ',
          link: 'https://www.dpt.go.th/th/press-release/8140',
          category: 'ข่าวงานผังประเทศและผังภาค',
          pubDate: 'Thu, 16 Feb 2023 13:34:56 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๑ ผังเมืองรวมชุมชนทุ่งตะโก จังหวัดชุมพร',
          description:
            'ขอเชิญเข้าร่วมประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๑ ผังเมืองรวมชุมชนทุ่งตะโก จังหวัดชุมพร',
          link: 'https://www.dpt.go.th/th/press-release/8136',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Tue, 14 Feb 2023 11:13:27 +0700',
        },
        {
          title:
            'กรมโยธาฯ แจง ประเด็น ”วุ่นอีก !! ชาวอำเภอบ้านแพงลุกฮือโวย กรมโยธาฯ นั่งเทียนออกผังเมืองลิดรอนสิทธิ์”',
          description:
            'กรมโยธาฯ แจง ประเด็น ”วุ่นอีก !! ชาวอำเภอบ้านแพงลุกฮือโวย กรมโยธาฯ นั่งเทียนออกผังเมืองลิดรอนสิทธิ์” ยันทุกอย่างจะต้องดำเนินการภายใต้ความต้องการของพี่น้องประชาชน',
          link: 'https://www.dpt.go.th/th/press-release/8133',
          category: 'ชี้แจงประเด็นข่าว',
          pubDate: 'Mon, 13 Feb 2023 14:23:16 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมเพื่อรับฟังความคิดเห็นของประชาชน ก่อนจัดทำผังแนวคิด (ประชุมกลุ่มย่อยครั้งที่ ๑) ผังเมืองรวมชุมชนควนกาหลง จังหวัดสตูล',
          description:
            'ขอเชิญเข้าร่วมประชุมเพื่อรับฟังความคิดเห็นของประชาชน ก่อนจัดทำผังแนวคิด (ประชุมกลุ่มย่อยครั้งที่ ๑) ผังเมืองรวมชุมชนควนกาหลง จังหวัดสตูล',
          link: 'https://www.dpt.go.th/th/press-release/8128',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Tue, 07 Feb 2023 15:50:12 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๒ ผังเมืองรวมเมืองชลบุรี',
          description:
            'ขอเชิญเข้าร่วมประชุมรับฟังความคิดเห็นของประชาชนก่อนจัดทำร่างผังเมืองรวม ครั้งที่ ๒ ผังเมืองรวมเมืองชลบุรี',
          link: 'https://www.dpt.go.th/th/press-release/8127',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Mon, 06 Feb 2023 15:41:51 +0700',
        },
        {
          title:
            'ขอเชิญเข้าร่วมการประชุมเชิงปฏิบัติการ (ประชุมกลุ่มย่อย เพื่อจัดทำผังแนวคิด) ครั้งที่ ๑/๒๕๖๖ ผังเมืองรวมชุมชนบ้านด่าน จังหวัดบุรีรัมย์',
          description:
            'ขอเชิญเข้าร่วมการประชุมเชิงปฏิบัติการ (ประชุมกลุ่มย่อย เพื่อจัดทำผังแนวคิด) ครั้งที่ ๑/๒๕๖๖ ผังเมืองรวมชุมชนบ้านด่าน จังหวัดบุรีรัมย์',
          link: 'https://www.dpt.go.th/th/press-release/8126',
          category: 'ขอเชิญประชุมเรื่องผังเมือง',
          pubDate: 'Thu, 02 Feb 2023 11:11:55 +0700',
        },
        {
          title:
            'กรมโยธาฯ แจง กรณี “โครงการพัฒนาคลองลำท่าแดงล่าช้า” สั่งเร่งรัดการก่อสร้างและแก้ไขจุดชำรุด บรรเทาความเดือดร้อนพี่น้องประชาชน',
          description:
            'กรมโยธาฯ แจง กรณี “โครงการพัฒนาคลองลำท่าแดงล่าช้า” สั่งเร่งรัดการก่อสร้างและแก้ไขจุดชำรุด บรรเทาความเดือดร้อนพี่น้องประชาชน',
          link: 'https://www.dpt.go.th/th/press-release/8121',
          category: 'ชี้แจงประเด็นข่าว',
          pubDate: 'Fri, 27 Jan 2023 21:10:46 +0700',
        },
      ],
    },
  ];
  newsCategoryList = [
    {
      id: 1,
      label: 'ข่าวกิจกรรม',
      code: 'CMS',
    },
    {
      id: 2,
      label: 'ข่าวประชาสัมพันธ์ทั่วไป',
      code: 'DMS',
    },
    {
      id: 3,
      label: 'ข่าวตัดจากหนังสิอพิมพ์',
      code: 'EMS',
    },
    {
      id: 4,
      label: 'ข่าว/ประกาศกรม',
      code: 'FMS',
    },
    {
      id: 5,
      label: 'วารสารกรม',
      code: 'GMS',
    },
  ];
  currentNews = this.newsList[0];
  constructor(private route: Router) {}

  onOpenFile(a: any) {}
  ngOnInit(): void {}
  onClick(link: string) {
    window.open(link, '_blank');
  }
}
